[Abilities.A_ProtectiveShell H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="防护外壳"
mTooltip="该单位受到特殊外壳的保护，抵御所有魔法法术和效果。所有魔法伤害减半，且该单位无法被侧击。"

[Abilities.A_SummonCocoon_Buff H7BaseBuff]
mName="繁殖"
mTooltip="每回合，此单位增加 %special1，直到效果耗尽（不增加爆炸伤害）。\n增殖在 %durnow 回合后结束。"

[Abilities.A_CocoonSummoner H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="折磨召唤师"
mTooltip="允许英雄每场战斗召唤一次茧，茧内充满随时间爆炸的挥发性炸药。"

[Abilities.A_VoidShield_Buff H7BaseBuff]
mName="虚空之盾"
mTooltip="一个环绕该单位的护盾，吸收所有魔法（使该单位免疫）。持续 %durnow 回合。"

[Abilities.A_Cocoon_Explosion_Buff H7BaseBuff]
mName="爆炸危险"
mTooltip="茧将随时间爆炸，对所有附近单位造成 %d1.min 到 %d1.max %icon_damage 伤害。距离爆炸剩余回合数：%durnow 回合。"

[Abilities.A_Cocoon_Explosion H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="不稳定"
mTooltip="此生物体内充满危险物质，会在 %buff.buff.durini 回合内点燃并爆炸。\n如果它被提前摧毁，则鸟类被中和，爆炸不会发生。"

[Abilities.A_SummonCocoon H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="召唤茧"
mTooltip="在战场上的一个空闲1x1格子上召唤 %special1.val1 个茧。"

[Abilities.A_VoidShield H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="虚空之盾"
mTooltip="每场战斗一次，他可以召唤一个护盾环绕另一个友方目标单位并吸收所有魔法。持续 %buff1.buff.durini 回合。"

[Creatures.A_CreatureMineBeetle H7Creature]
mName="矿坑士兵"
mLore="矿坑士兵是首批被秽巢实体控制并改造以像人类一样站立和思考的生物，它们迅速学会了以非凡的灵巧和速度使用武器。"

[Creatures.A_CreatureMineDevil H7Creature]
mName="矿坑哨兵"
mLore="矿坑中最强壮的士兵被选出来保护秽巢巢穴的重要地点，从而获得了哨兵的军衔。"